import { Link, Outlet } from 'react-router-dom';
import { Container } from 'components/Common/Common.styled';
import {
	Title,
	MenuList,
	MenuItem,
	MenuLink,
} from '../Services/Services.styled';
import {
	HeroBox,
	TitleDesign,
	TextDesign,
	TextDesignDescription,
	FormSection,
} from './InteriorDesign.styled';
import WhiteForm from 'components/Forms/WhiteForm';

function InteriorDesign() {
	return (
		<>
			<HeroBox>
				<Container>
					<Title>Дизайн інтер'єрів</Title>
					<MenuList>
						<MenuItem>
							<MenuLink to="/">Головна</MenuLink>
						</MenuItem>
						<MenuItem>
							<MenuLink to="/services">Послуги</MenuLink>
						</MenuItem>
						<MenuItem>
							<MenuLink to="/services/interiorDesign">
								Дизайн інтер'єрів
							</MenuLink>
						</MenuItem>
					</MenuList>
				</Container>
			</HeroBox>
			<Container>
				<section>
					<TitleDesign>Дизайн інтер'єру квартир в Одесі</TitleDesign>
					<TextDesign>Проектування сучасного дизайну у 3D</TextDesign>
					<TextDesignDescription>
						Дизайн-проект в Одесі — довірте створення інтер'єру «ОДСК» та
						отримайте сучасний дизайн квартири за вигідною ціною, створеною з
						урахуванням Ваших побажань та специфіки приміщення.
					</TextDesignDescription>
				</section>
			</Container>
			<FormSection>
				<Container>
					<WhiteForm/>
				</Container>
			</FormSection>
			<Container>
				<div>
					<h2>Вартість дизайн-проекту</h2>
					<p>
						Маючи багаторічний досвід роботи з одеським ринком нерухомості, наші
						фахівці знають як перетворити на переваги навіть суттєві недоліки
						планування квартир, знають, як правильно їх зробити непомітними й
						підкреслити переваги, виділивши та скоригувавши все так, щоб додати
						родзинки та шарму приміщенням.
					</p>
					<p>
						При цьому ціна дизайн-проекту складає від 8 до 18 доларів за 1 м².
					</p>
				</div>
				<p>
					<span>Вартість</span> дизайну інтер'єру залежить від:
				</p>
				<ul>
					<li>Площі та конструктивних особливостей приміщення</li>
					<li>Кількості кімнат</li>
					<li>Складності кінцевого результату</li>
				</ul>
				<div>
					<img alt="Вартість дизайн-проекту" />
				</div>
			</Container>
			<div>
				<Container>
					<h2>
						<span>Ціна</span> дизайн-проекту
					</h2>
					<ul>
						<li>
							<p>Повний комплект креслень</p>
							<p>$8 / м.кв.</p>
							<ul>
								<li>Обмірний план</li>
								<li>План демонтажу</li>
								<li>План монтажу</li>
								<li>План після монтажу</li>
								<li>План розташування меблів із габаритами</li>
								<li>План сантехнічних приладів </li>
								<li>План електрики (настінні електрозаводи та розетки)</li>
								<li>
									План стельових світильників та підсвічування з прив'язками
								</li>
								<li>
									План стельових світильників з угрупованнями та вимикачами
								</li>
								<li>План стель та стельових конструкцій</li>
								<li>План підлогових покриттів</li>
								<li>План теплої підлоги</li>
								<li>План кондиціювання</li>
							</ul>
							<p>Терміни: 3 тижні з моменту затвердження планування</p>
						</li>
						<li>
							<p>Повний дизайн-проект</p>
							<p>$17 / м.кв.</p>
							<ul>
								<li>Початковий виїзд на обмір приміщення</li>
								<li>
									Декілька варіантів з переплануванням та розташуванням меблів
								</li>
								<li>
									<div>
										Робочі креслення:
										<ul>
											<li>Обмірний план</li>
											<li>План демонтажу</li>
											<li>План монтажу</li>
											<li>План після монтажу</li>
											<li>План розташування меблів із габаритами</li>
											<li>План сантехнічних приладів</li>
											<li>
												План електрики (настінні електрозаводи та розетки)
											</li>
											<li>
												План стельових світильників та підсвічування з
												прив'язками
											</li>
											<li>
												План стельових світильників з угрупованнями та
												вимикачами
											</li>
											<li>План стель та стельових конструкцій</li>
											<li>План підлогових покриттів</li>
											<li>План теплої підлоги</li>
											<li>План кондиціювання</li>
										</ul>
									</div>
								</li>
								<li>3D візуалізація з коригуваннями до 3-х разів</li>
								<li>Кошторис на роботу</li>
								<li>Онлайн супровід всього будівельного процесу</li>
							</ul>
						</li>
					</ul>
					<Link>Замовити проект</Link>
				</Container>
			</div>
			<div>
				<Container>
					<p>Мы чекаємо Вашої заявки</p>
					<form>
						<div>
							<input placeholder="Ім'я"></input>
							<input placeholder="Телефон"></input>
							<input placeholder="E-mail"></input>
						</div>
						<button type="submit">надіслати</button>
					</form>
				</Container>
			</div>
			<Container>
				<div>
					<h2>Дизайн інтер'єру в Одесі</h2>
					<p>
						Комфорт та затишок – це те, до чого людина завжди прагне, створити
						максимально комфортну атмосферу навколо себе, яка відповідатиме її
						смакам та вимогам до функціональності. І неважливо це буде будинок,
						робочий кабінет, офіс або квартира. Приміщення в якому проводиться
						більша частина часу, повинне крім того, що відповідати своєму
						призначенню, ще й гармонувати з індивідуальністю, не викликати
						роздратування та налаштовувати на потрібний лад.
					</p>
					<p>
						Самостійно впоратися з таким завданням та грамотно розробити дизайн
						інтер'єру під силу далеко не всім. У цьому Вам допоможуть наші
						спеціалісти з дизайну квартир, заощаджуючи ваш час та сили, вони
						врахують будь-які побажання та завжди підкажуть правильне рішення
						виходячи з індивідуальних особливостей.
					</p>
				</div>
				<div>
					<img src="" alt="Дизайн интерьера" />
				</div>
				<p>Дизайн інтер'єру на замовлення – це:</p>
				<ul>
					<li>Гарантія якісного результату</li>
					<li>Використання сучасних модних тенденцій та технологій</li>
					<li>Правильне та зручне зонування</li>
					<li>Розумне витрачання коштів</li>
					<li>Економія вільного часу та фінансів</li>
					<li>Можливість максимально оптимізувати простір</li>
				</ul>
				<p>
					Наші фахівці зроблять реальністю дизайн квартири, про який ви мрієте
				</p>
				<div>
					<img src="" alt="дизайн квартири" />
					<img src="" alt="дизайн квартири" />
				</div>
				<p>
					Постійне вдосконалення та вивчення сучасних модних тенденцій,
					різноплановість виконаних робіт, широке портфоліо та багаторічний
					досвід дозволяють професійній команді наших дизайнерів швидко
					зорієнтуватися в тому, чого саме хоче клієнт і запропонувати відразу
					декілька найбільш підходящих дизайнів інтер'єру, ціна яких буде
					відповідати бюджету.
				</p>
				<h2>Основні етапи розробки дизайну проекту квартири в Одесі</h2>
				<p>
					Дизайн інтер'єру квартири в сучасному чи класичному стилі – це
					трудомісткий процес, який ділиться на кілька етапів:
				</p>
				<ol>
					<li>
						<p>1 Етап</p>
						<p>Ви зв'язуєтесь з нами будь-яким зручним для вас способом.</p>
					</li>
					<li>
						<p>2 Етап</p>
						<p>Домовляємось про зустріч. Виїзд спеціаліста на об'єкт.</p>
					</li>
					<li>
						<p>3 Етап</p>
						<p>
							Виконання обмірювального плану. І пропозиція планувальних рішень.
						</p>
					</li>
					<li>
						<p>4 Етап</p>
						<p>Робота по виконанню дизайн проекту.</p>
					</li>
					<li>
						<p>5 Етап</p>
						<p>Затвердження дизайну проекту з замовником.</p>
					</li>
					<li>
						<p>6 Етап</p>
						<p>Здача дизайну проекту, передача альбому.</p>
					</li>
				</ol>
				<div>
					<h2>Дизайн інтер'єру від компанії ОДСК</h2>
					<p>
						Використовуючи інноваційні технології та актуальні сучасні
						тенденції, наші фахівці творчо підходять до процесу конструювання
						внутрішнього простору. Розробляють ексклюзивні проекти, спираючись
						на смакові уподобання клієнтів та застосовуючи нестандартні
						дизайнерські прийоми, наші фахівці зроблять все якнайкраще.
					</p>
				</div>
				<div>
					<p>
						<span>Вартість</span> дизайну інтер'єру залежить від:
					</p>
					<ul>
						<li>Швидке професійне обслуговування</li>
						<li>Гарантія високої якості</li>
						<li>
							Широкий спектр послуг з розробки дизайну та проведення ремонтних
							робіт
						</li>
						<li>
							Допомога у підборі та купівлі надійних та безпечних будматеріалів
						</li>
						<li>Гнучкий та лояльний підхід до формування вартості дизайну</li>
					</ul>
					<p>
						Окрім укладання договору, що містить перелік робіт, терміни їх
						проведення та вартість, наша компанія надає Вам гарантійні
						зобов'язання під час проведення ремонтних робіт.
					</p>
				</div>
				<div>
					<img src="" alt="girl" />
				</div>
				<div>
					<h2>Наші фахівці завжди готові:</h2>
					<ol>
						<li>
							<div>
								<img src="" alt="Наші фахівці" />
							</div>
							<p>
								Здійснювати контроль за коректним виконанням дизайнерських
								рішень
							</p>
						</li>
						<li>
							<div>
								<img src="" alt="Наші фахівці" />
							</div>
							<p>
								Надати консультативну допомогу будівельникам щодо питань
								реалізації розробленого дизайну
							</p>
						</li>
						<li>
							<div>
								<img src="" alt="Наші фахівці" />
							</div>
							<p>
								Внести доповнення та коригування за бажанням клієнта, а також у
								випадках виявлення технологічної необхідності, виявленої в
								процесі робіт
							</p>
						</li>
						<li>
							<div>
								<img src="" alt="Наші фахівці" />
							</div>
							<p>Підібрати декоративні та оздоблювальні матеріали</p>
						</li>
						<li>
							<div>
								<img src="" alt="Наші фахівці" />
							</div>
							<p>
								Запропонувати широкий асортимент високоякісних товарів та
								сантехніки для дому
							</p>
						</li>
						<li>
							<div>
								<img src="" alt="Наші фахівці" />
							</div>
							<p>
								Провести декорування приміщення на завершальній стадії виконання
								робіт
							</p>
						</li>
					</ol>
				</div>
				<div>
					<h2>3Д-дизайн інтер'єру в Одесі</h2>
					<p>
						Пропонуємо створювати дизайн інтер'єру у 3D візуалізації. Наші
						фахівці в Одесі зроблять це для вас швидко та якісно.
					</p>
					<p>
						Наші фахівці нададуть Вам макет майбутньої обстановки, покажуть
						стилістику та дизайн інтер'єру в об'ємному форматі, і тоді Ви
						зможете правильно оцінити концепцію, доцільність зонування та
						планування. А також у вас буде можливість внести коригування та
						зміни до початку робіт.
					</p>
					<img src="" alt="3Д-дизайн інтер'єру в Одесі" />
				</div>
				<div>
					<h2>
						Дизайн інтер'єру в Одесі – найкращі проекти для вашого комфорту
					</h2>
					<p>
						Висококваліфіковані фахівці компанії ОДСК здійснюють професійну
						розробку дизайн-проектів, швидке та якісне оформлення інтер'єру
						незалежно від обсягів та складності передбачуваних робіт.
						Максимально оптимізують і задіють простір, приділяючи увагу кожному
						сантиметру площі. Виконують моделювання інтер'єру на найвищому рівні
						– швидко, естетично та якісно.
					</p>
					<p>
						Завдяки величезному досвіду, фахівці компанії ОДСК намагаються
						максимально врахувати та адаптувати переваги та побажання замовника
						під реальні можливості вихідного приміщення, внести коригування та
						доповнення, поєднуючи все це з сучасними тенденціями, щоб фінальний
						результат перевершив найсміливіші очікування, став відображенням
						індивідуальності та дарував радість довгі роки.
					</p>
					<div>
						<img
							src=""
							alt="Дизайн інтер'єру – найкращі проекти для вашого комфорту"
						/>
					</div>
				</div>
				<div>
					<h2>Фото наших робіт</h2>
					<p>Усі фотографії – це реальні роботи Дизайн студії «ОДСК»</p>
					<div>
						<Link>
							<div>
								<img src="" alt="" />
							</div>
							<p>ЖК Дмитрієвський 85 кВ метрів</p>
						</Link>
					</div>
					<Link>Переглянути всі фото</Link>
				</div>
				<div>
					<h2>
						Професійне створення інтер'єру - стильна та функціональна обстановка
						в найкоротші терміни.
					</h2>
					<p>
						Оформлення інтер'єру робочого або домашнього простору - це
						насамперед відображення уявлень про комфорт та смак його господаря.
						На жаль, без певних знань та навичок самостійне проектування
						інтер'єру призводить до появи великої кількості помилок, які з часом
						вимагають додаткових вкладень для їх виправлення.{' '}
					</p>
					<p>
						Грамотний фахівець, починаючи роботу над простором, насамперед
						проводить його зонування, поділяє приміщення на ділянки відповідно
						до їх індивідуальних завдань, при цьому зберігаючи єдину стилістику
						всієї обстановки. Наповнює виділені зони фактурою, кольором, певними
						деталями та необхідними предметами меблів, з урахуванням побажань та
						уподобань клієнта.
					</p>
					<p>
						Створюючи дизайн-проект інтер'єру, професійний розробник
						перетворюється на справжнього проектувальника та художника, який
						визначає основні моменти, продумує всі конструктивні особливості,
						створює унікальну обстановку, що поєднує стиль, ергономічність та
						зручність, що поєднує, здавалося б, несумісні деталі. Також важливим
						фактором у залученні професійного дизайнера є те, що він свою роботу
						робить дуже швидко із застосуванням спеціалізованого програмного
						забезпечення.
					</p>
					<div>
						<img src="" alt="" />
					</div>
					<p>
						{' '}
						<span>Замовити</span> дизайн-проект інтер'єру, викликати дизайнера
						на об'єкт, а також зв'язатися з фахівцями
					</p>
					<p>
						для отримання професійної консультації можна за вказаними номерами
						телефонів на сайті або скориставшись зручною формою онлайн-заявки.
						Менеджер компанії зв'яжеться з вами для обговорення питань, що
						цікавлять, допоможе зорієнтуватися в обсягах та вартості послуг.
					</p>
					<p>
						Скористайтеся шансом втілити в реальність найсміливіші проекти, ідеї
						та задуми, у максимально короткі терміни, та за вигідною ціною!
					</p>
					<Link>Замовити проект</Link>
				</div>
			</Container>

			<Outlet />
		</>
	);
}

export default InteriorDesign;
