import stregnt1 from 'Assets/img/MainStrength/mainstrength1.jpg';
import stregnt2 from 'Assets/img/MainStrength/mainstrength2.jpg';
import stregnt3 from 'Assets/img/MainStrength/mainstrength3.jpg';
import stregnt4 from 'Assets/img/MainStrength/mainstrength4.jpg';

const data = [
	{
		img: stregnt1,
		header: 'УКЛАДАННЯ ДОГОВОРУ',
		text: "Під час укладання договору ми прописуємо заздалегідь обумовлені терміни проведення ремонтних робіт та фактичну дату здачі об'єкту. Також до договору будуть внесені проміжні етапи із зазначенням їхньої тривалості та вартості. Наша компанія відповідально підходить до своєї роботи та взятих на себе зобов'язань, зазначених у Договорі.",
	},
	{
		img: stregnt2,
		header: 'ДОТРИМАННЯ ТЕРМІНІВ',
		text: "Ми усвідомлюємо, як важливо для клієнтів знати термін завершення ремонтних робіт і тому робимо все можливе, щоб Ви могли вселитися в квартиру з ремонтом в обумовлені терміни. Усі дати ретельно розраховуються, відштовхуючись від обсягу робіт, стану об'єкта, з урахуванням термінів доставки матеріалів, кількість осіб у будівельній бригаді тощо.",
	},
	{
		img: stregnt3,
		header: 'ДОПОМОГА В ПРИДБАННІ МАТЕРІАЛІВ',
		text: 'Наші фахівці підкажуть які матеріали краще підібрати для тих чи інших робіт, залежно від специфіки та призначення приміщень. А також підкажуть, де Ви зможете придбати вибрані матеріали за вигідною ціною або зроблять це за Вас за попередньою домовленістю.',
	},
	{
		img: stregnt4,
		header: 'ТОЧНІСТЬ РОЗРАХУНКІВ',
		text: 'Кожен етап роботи та його вартість узгоджується з Вами завчасно та оплачується після закінчення робіт. Не треба одразу платити за всі етапи. Вартість матеріалів здійснюється також за фактом доставки їх на місце проведення робіт. Ціна ремонтних робіт буде розрахована максимально швидко та точно за наявності дизайн-проекту.',
	},
];

export default data;
